Revit 2027 API
DisplacementElement.GetDisplacementElementId Method
 The element id of the DisplacementElement that includes the specified element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId GetDisplacementElementId(
	View view,
	ElementId id
)
Public Shared Function GetDisplacementElementId (
	view As View,
	id As ElementId
) As ElementId
public:
static ElementId^ GetDisplacementElementId(
	View^ view,
	ElementId^ id
)
static member GetDisplacementElementId :
        view : View *
        id : ElementId -> ElementId
Parameters
view View
 The view.
id ElementId
 The element id.
Return Value
ElementId
 The element id of DisplacementElement that includes the specified element id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DisplacementElement Class
Autodesk.Revit.DB Namespace